Revit 2024 API
ExternalDefinition Methods
The ExternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDataType
 Gets a ForgeTypeId identifying the data type describing values of the parameter.
 (Inherited from Definition.)
GetGroupTypeId
 Returns the identifier of the parameter definition's parameter group.
 (Overrides Definition.GetGroupTypeId().)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace